
--
-- Dumping data for table 'authors'
--

INSERT INTO 'authors' VALUES (1,'Агата','Крісті'),
                             (2,'Айн','Ренд'),
                             (3,'Анджей','Сапковський'),
                             (4,'Артур Конан','Дойл'),
                             (5,'Говард Філіпс','Лавкрафт'),
                             (6,'Джоан','Гарріс'),
                             (7,'Джоан','Роулінг'),
                             (8,'Джон','Толкін'),
                             (9,'Джордж','Орвелл'),
                             (10,'Едгар Аллан','По'),
                             (11,'Елена','Ферранте'),
                             (12,'Еліс','Гофман'),
                             (13,'Ендрю','Мейн'),
                             (14,'Ерік','Рікстед'),
                             (15,'Еріх Марія','Ремарк'),
                             (16,'Ернест','Гемінґвей'),
                             (17,'Ілларіон','Павлюк'),
                             (18,'Кейт Елізабет','Расселл'),
                             (19,'Лі','Бардуґо'),
                             (20,'Ліна','Костенко'),
                             (21,'Лоран','Гунель'),
                             (22,'Марк','Твен'),
                             (23,'Милан','Кундера'),
                             (24,'Оксана','Забужко'),
                             (25,'Роальд','Дал'),
                             (26,'Роберт','Джордан'),
                             (27,'Саллі','Руні'),
                             (28,'Славенка','Дракуліч'),
                             (29,'Террі','Пратчетт'),
                             (30,'Філіп','Брено'),
                             (31,'Фредрік','Бакман'),
                             (32,'Френк','Герберт'),
                             (33,'Халед','Госсейні'),
                             (34,'Ханна','Оренстейн'),
                             (35,'Юрій','Андрухович'),
                             (36,'Летісія','Корен'),
                             (37,'Карпенко','Карий'),
                             (38,'Люсьєн','Мархо'),
                             (39,'Понтій','Пілат'),
                             (40,'Понтій','Понтифік');

--
-- Dumping data for table 'book_genre'
--

INSERT INTO 'book_genre' VALUES (1,1,1),(2,2,2),
                                (3,3,3),(4,4,3),
                                (5,5,1),(6,6,4),
                                (7,7,5),(8,8,6),
                                (9,9,6),(10,10,6),
                                (11,11,6),(12,12,6),
                                (13,13,6),(14,14,6),
                                (15,15,2),(16,16,7),
                                (17,17,1),(18,18,8),
                                (19,19,3),(20,20,3),
                                (21,21,3),(22,22,5),
                                (23,23,6),(24,24,3),
                                (25,25,3),(26,26,3),
                                (27,27,4),(28,28,3),
                                (29,29,3),(30,30,3),
                                (31,31,3),(32,32,6),
                                (33,33,3),(34,34,6),
                                (35,35,3),(36,36,3),
                                (37,37,9),(38,38,3),
                                (39,39,6),(40,40,9),
                                (41,41,3),(42,42,6),
                                (43,43,2),(44,44,6),
                                (45,45,6),(46,46,6),
                                (47,47,3);

--
-- Dumping data for table 'book_user'
--

INSERT INTO 'book_user' VALUES (6,15,7,'2022-06-25','2022-10-13',''),
                               (7,2,4,'2022-06-26','2022-07-26',NULL),
                               (8,35,4,'2022-06-26','2022-07-20',NULL),
                               (18,23,2,'2022-07-13','2022-08-12',''),
                               (20,21,2,NULL,NULL,''),
                               (21,24,2,'2022-07-22','2022-08-11',''),
                               (22,1,2,'2022-06-30','2022-07-30',''),
                               (23,26,12,'2022-07-13','2022-08-12',''),
                               (25,45,12,'2022-07-13','2022-08-12',''),
                               (26,4,12,'2022-07-14','2022-08-13',''),
                               (27,31,12,NULL,NULL,''),
                               (33,4,18,'2022-07-14','2022-07-23',''),
                               (38,17,18,'2022-07-19','2022-07-22','paid'),
                               (39,40,18,NULL,NULL,''),
                               (40,1,18,'2022-07-23','2022-08-12',''),
                               (41,26,18,NULL,NULL,''),(43,46,18,NULL,NULL,'');

--
-- Dumping data for table 'books'
--

INSERT INTO 'books' VALUES (1,'9789662355574','1984','2015','1.jpg',1,0),
                           (2,'9789667047474','Чарлі і шоколадна фабрика','2009','2.jpg',2,0),
                           (3,'9789667047887','Записки українського самашедшого','2011','3.jpg',2,0),
                           (4,'9786171215528','Бог завжди подорожує інкогніто','2016','4.jpg',3,0),
                           (5,'9786171276895','Дюна','2021','5.jpg',3,0),
                           (6,'9786171281233','Карти на стіл','2020','6.jpg',3,0),
                           (7,'9786171268449','П\'ять четвертинок апельсина','2019','7.jpg',3,0),
                           (8,'9789667047344','Гаррі Поттер і таємна кімната','2017','8.jpg',2,0),
                           (9,'9789667047369','Гаррі Поттер i в’язень Азкабану','2017','9.jpg',2,0),
                           (10,'9786175851005','Гаррі Поттер і філософський камінь','2017','10.jpg',2,0),
                           (11,'9789667047407','Гаррі Поттер і кубок вогню','2017','11.jpg',2,0),
                           (12,'9789667047290','Гаррі Поттер і Напівкровний принц','2017','12.jpg',2,0),
                           (13,'9789667047702','Гаррі Поттер і смертельні реліквії','2017','13.jpg',2,0),
                           (14,'9786175851241','Фантастичні звірі і де їх шукати','2017','14.jpg',2,0),
                           (15,'9786170707086','Пригоди Тома Сойєра','2019','15.jpg',4,0),
                           (16,'9786176798323','Я бачу, вас цікавить пітьма','2020','16.jpg',5,0),
                           (17,'9786176642077','Володар перснів. Братство персня','2020','17.jpg',6,0),
                           (18,'9786177818396','Неймовірна історія сексу. Книга 1: Захід','2021','18.jpg',7,0),
                           (19,'786176799580','Ловець повітряних зміїв','2021','19.jpg',5,0),
                           (20,'9789669763969','Моя бабуся просить їй вибачити','2019','20.jpg',8,0),
                           (21,'9786176797012','Нестерпна легкість буття','2019','21.jpg',5,0),
                           (22,'9786176798026','Нормальні люди','2020','22.jpg',5,0),
                           (23,'9789669821836','Дев\'ятий Дім','2021','23.jpg',9,0),
                           (24,'9786177286652','Ніби мене нема(є)','2020','24.jpg',10,0),
                           (25,'9786170931429','Шлюб протилежностей','2017','25.jpg',11,0),
                           (26,'9786177279166','Атлант розправив плечі. Частина 3. А є А','2019','26.jpg',12,0),
                           (27,'9786177563524','Дівчата, які нічого не скажуть','2019','27.jpg',8,0),
                           (28,'9789669822383','Моя темна Ванесса','2020','28.jpg',9,0),
                           (29,'9786177585502','Повне зібрання прозових творів. Том І. Говард Лавкрафт','2022','29.jpg',1,0),
                           (30,'9786178024055','Радіо Ніч','2021','30.jpg',13,0),
                           (31,'9786176795094','По кому подзвін','2018','31.jpg',5,0),
                           (32,'9786171281400','Відьмак. Меч призначення. Книга 2','2020','32.jpg',3,0),
                           (33,'9786171291423','Моя неймовірна подруга. Книга 1','2021','33.jpg',3,0),
                           (34,'9789661063173','Колесо Часу. Книга 1. Око Світу','2021','34.jpg',14,0),
                           (35,'9786177820061','Гра в пари','2020','35.jpg',8,0),
                           (36,'9786177286492','Польові дослідження з українського сексу','2019','36.jpg',10,0),
                           (37,'9786177585236','Повне зібрання прозових творів. Том І. Едґар Аллан По','2020','37.jpg',1,0),
                           (38,'9786177820764','Шляхи життя','2021','38.jpg',8,0),
                           (39,'9786171283503','Відьмак. Кров ельфів. Книга 3','2021','39.jpg',3,0),
                           (40,'9786177563791','Хованки з хижаком','2019','40.jpg',8,0),
                           (41,'9786176794448','Чоловіки без жінок та інші оповідання','2017','41.jpg',5,0),
                           (42,'9786176794691','Право на чари','2017','42.jpg',5,0),
                           (43,'9789660104488','Пригоди Шерлока Холмса. Том I','2010','43.jpg',14,0),
                           (44,'9786171291041','Відьмак. Сезон гроз. Книга 8','2021','44.jpg',3,0),
                           (45,'9786171288485','Відьмак. Вежа Ластівки. Книга 6','2021','45.jpg',3,0),
                           (46,'9786171288478','Відьмак. Хрещення вогнем. Книга 5','2021','46.jpg',3,0),
                           (47,'9786171243149','На Західному фронті без змін','2017','47.jpg',3,0);


--
-- Dumping data for table 'books_authors'
--

INSERT INTO 'books_authors' VALUES (1,1,9),(2,2,25),(3,3,20),
                                   (4,4,21),(5,5,32),(6,6,1),
                                   (7,7,6),(8,8,7),(9,9,7),
                                   (10,10,7),(11,11,7),(12,12,7),
                                   (13,13,7),(14,14,7),(15,15,22),
                                   (16,16,17),(17,17,8),(18,18,30),
                                   (19,18,36),(20,19,33),(21,20,31),
                                   (22,21,23),(23,22,27),(24,23,19),
                                   (25,24,28),(26,25,12),(27,26,2),
                                   (28,27,14),(29,28,18),(30,29,5),
                                   (31,30,35),(32,31,16),(33,32,3),
                                   (34,33,11),(35,34,26),(36,35,34),
                                   (37,36,24),(38,37,10),(39,38,31),
                                   (40,39,3),(41,40,13),(42,41,16),
                                   (43,42,29),(44,43,4),(45,44,3),
                                   (46,45,3),(47,46,3),(48,47,15);


--
-- Dumping data for table 'current_books'
--

INSERT INTO 'current_books' VALUES (1,1,3),(2,2,6),(3,3,2),
                                   (4,4,1),(5,5,3),(6,6,5),
                                   (7,7,4),(8,8,4),(9,9,4),
                                   (10,10,1),(11,11,4),(12,12,2),
                                   (13,13,1),(14,14,4),(15,15,5),
                                   (16,16,3),(17,17,0),(18,18,1),
                                   (19,19,3),(20,20,4),(21,21,3),
                                   (22,22,3),(23,23,1),(24,24,2),
                                   (25,25,3),(26,26,3),(27,27,2),
                                   (28,28,4),(29,29,1),(30,30,4),
                                   (31,31,5),(32,32,4),(33,33,4),
                                   (34,34,5),(35,35,3),(36,36,1),
                                   (37,37,1),(38,38,1),(39,39,2),
                                   (40,40,3),(41,41,1),(42,42,3),
                                   (43,43,5),(44,44,1),(45,45,0),
                                   (46,46,3),(47,47,2);


--
-- Dumping data for table 'genres'
--

INSERT INTO 'genres' VALUES (1,'Фантастика'),(2,'Пригоди'),
                            (3,'Проза'),(4,'Детектив'),
                            (5,'Роман'),(6,'Фентезі'),
                            (7,'Триллер'),(8,'Комікс'),
                            (9,'Жахи'),(10,'Історичні'),
                            (11,'Fantasy_update');


--
-- Dumping data for table 'publishers'
--

INSERT INTO 'publishers' VALUES (1,'Видавництво Жупанського','','',''),
                                (2,'Абабагаламага','','',''),
                                (3,'Книжковий клуб «Клуб Сімейного Дозвілля»','','',''),
                                (4,'Знання','','',''),
                                (5,'Видавництво Старого Лева','','',''),
                                (6,'Астролябія','','',''),
                                (7,'Видавництво','','',''),
                                (8,'книголав','','',''),
                                (9,'Vivat','','',''),
                                (10,'Комора','','',''),
                                (11,'Фабула','','',''),
                                (12,'Наш Формат','','',''),
                                (13,'Meridian Czernowitz','','',''),
                                (14,'Навчальна книга – Богдан','','',''),
                                (15,'Книгоклюб',NULL,NULL,NULL),
                                (16,'Старий Рим',NULL,NULL,NULL);

--
-- Dumping data for table 'roles'
--

INSERT INTO 'roles' VALUES (1,'admin','enabled'),(2,'librarian','enabled'),(3,'user','enabled');


--
-- Dumping data for table 'users'
--

INSERT INTO 'users' VALUES (1,'84562311','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Julia','Cross','1990-02-13','+380991234560','enabled','84562311.jpg',3,'en',''),
                           (2,'82834752','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Володимир','Тимчук','1995-05-14','+380991234561','enabled','82834752.jpg',3,'uk',''),
                           (3,'82635494','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Тарас','Бульба','1998-03-18','+380991234562','enabled','82635494.jpg',3,'uk',''),
                           (4,'85423997','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Олег','Винник','1997-03-16','+380991234563','enabled','85423997.jpg',3,'uk',''),
                           (5,'86235412','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Вікторія','Сікрет','1989-10-19','+380991234564','enabled','86235412.jpg',3,'uk',''),
                           (6,'84653416','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Аліна','Степаненко','1991-09-18','+380991234565','enabled','84653416.jpg',3,'uk',''),
                           (7,'81764822','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Володимир','Остапенко','1991-04-19','+380991234566','disabled','81764822.jpg',3,'uk',''),
                           (8,'89000234','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Олексій','Арестович','2000-11-10','+380991234567','enabled','89000234.jpg',3,'uk',''),
                           (9,'alan','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Алан','Прок','1979-02-11','+380991234568','enabled','alan.jpg',2,'uk',''),
                           (10,'mery','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Марія','Костенко','1985-06-14','+380991234569','enabled','mery.jpg',1,'uk',''),
                           (11,'admin','8c6976e5b5410415bde908bd4dee15dfb167a9c873fc4bb8a81f6f2ab448a918','Адміністратор','Систем','1990-05-18','+380991234570','enabled','admin.jpg',1,'uk',''),
                           (12,'89000235','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Павло','Завгородній','2022-05-30','+380635919450','enabled','89000235.jpg',3,'en',''),
                           (15,'nemo','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Captain','Nemo','1990-01-18','+380631111111','enabled','_blank.png',2,'uk',''),
                           (16,'89000236','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','First','Last','2000-01-01','+380991234567','enabled','_blank.png',3,'en',''),
                           (17,'nemor','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Павло','Петро','2000-01-01','+380631111111','disabled','_blank.png',2,'uk',''),
                           (18,'89000237','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Неллі','Тейлор','2001-05-05','+380631111113','enabled','89000237.jpg',3,'uk',''),
                           (19,'89000238','ffe1abd1a08215353c233d6e009613e95eec4253832a761af28ff37ac5a150c','Петро','Петренко','2000-01-10','+380631111111','enabled','_blank.png',3,'en','');

